In [ ]:
# Topics to complete-
# (1) Statistical Functions
# (2) Data Transformations

In [1]:
# Importing important libraries
import pandas as pd
import numpy as np

In [3]:
# Importing the dataset
df = pd.read_csv('Octane.csv')
df.head()

   Sample  Material1  Material2  Material3  Condition  Octane
0       1      55.33       1.72         54    1.66219   92.19
1       2      59.13       1.20         53    1.58399   92.74
2       3      57.39       1.42         55    1.61731   91.88
3       4      56.43       1.78         55    1.66228   92.80
4       5      55.98       1.58         54    1.63195   92.56

In [11]:
# Calculating mean for Material1, Material2, Material3, Condition and Octane columns
print("Sample\t\t=",df["Sample"].mean())
print("Material1\t=",df["Material1"].mean())
print("Material1\t=",df["Material2"].mean())
print("Material1\t=",df["Material3"].mean())
print("Condition\t=",df["Condition"].mean())
print("Octane\t\t=",df["Octane"].mean())

Sample		= 41.5
Material1	= 60.170609756097555
Material1	= 1.663658536585366
Material1	= 55.46341463414634
Condition	= 1.6265713414634146
Octane		= 91.84987804878048

In [14]:
# with for loop
for i in df:
    print(f"{i}\t=\t",df[i].mean())

Sample	=	 41.5
Material1	=	 60.170609756097555
Material2	=	 1.663658536585366
Material3	=	 55.46341463414634
Condition	=	 1.6265713414634146
Octane	=	 91.84987804878048

In [22]:
# with for loop
for i in df.columns[1:]:
    print(f"mean of {i}\t=\t",df[i].mean())

mean of Material1	=	 60.170609756097555
mean of Material2	=	 1.663658536585366
mean of Material3	=	 55.46341463414634
mean of Condition	=	 1.6265713414634146
mean of Octane	=	 91.84987804878048

In [24]:
# Calculating median for Material1, Material2, Material3, Condition and Octane columns
for i in df.columns[1:]:
    print(f"median of {i}\t=\t",df[i].median())

median of Material1	=	 62.695
median of Material2	=	 1.28
median of Material3	=	 56.0
median of Condition	=	 1.6035750000000002
median of Octane	=	 91.735

In [25]:
# Calculating mode for Material1, Material2, Material3, Condition and Octane columns
for i in df.columns[1:]:
    print(f"mode of {i}\t=\t",df[i].mode())

mode of Material1	=	 0      4.23
1      5.53
2     17.11
3     44.64
4     44.66
      ...
77    72.30
78    72.66
79    73.13
80    73.74
81    75.54
Name: Material1, Length: 82, dtype: float64
mode of Material2	=	 0    0.0
Name: Material2, dtype: float64
mode of Material3	=	 0    55
Name: Material3, dtype: int64
mode of Condition	=	 0     1.19975
1     1.20817
2     1.26174
3     1.28802
4     1.29842
       ...
77    2.08081
78    2.14314
79    2.17070
80    2.17140
81    2.31909
Name: Condition, Length: 82, dtype: float64
mode of Octane	=	 0    91.56
1    91.61
2    92.16
Name: Octane, dtype: float64

In [28]:
# mean using numpy
for i in df.columns[1:]:
    print(f"mode of {i}\t=\t",np.mean(df[i]))

mode of Material1	=	 60.170609756097555
mode of Material2	=	 1.663658536585366
mode of Material3	=	 55.46341463414634
mode of Condition	=	 1.6265713414634146
mode of Octane	=	 91.84987804878048

In [35]:
# median using numpy
for i in df.columns[1:]:
    print(f"median of {i}\t=\t",np.median(df[i]))

median of Material1	=	 62.695
median of Material2	=	 1.28
median of Material3	=	 56.0
median of Condition	=	 1.6035750000000002
median of Octane	=	 91.735

In [49]:
# Calculating count() for Material1, Material2, Material3, Condition and Octane columns

for i in df.columns[1:]:
    print(f"count of {i}\t=\t",df[i].count())

count of Material1	=	 82
count of Material2	=	 82
count of Material3	=	 82
count of Condition	=	 82
count of Octane	=	 82

In [56]:
# Printing the shape of df
shape = df.shape
print(f"DF has {shape[0]} rows")
print(f"DF has {shape[1]} column")

DF has 82 rows
DF has 6 column

In [57]:
# unique() : gives you unique values.
for i in df.columns[1:]:
    print(f"unique deviation of {i}\t=\t",df[i].unique())

unique deviation of Material1	=	 [55.33 59.13 57.39 56.43 55.98 56.16 54.85 52.83 54.52 54.12 51.72 51.29
 53.22 54.76 53.34 54.84 54.03 51.44 53.54 57.88 60.93 59.59 61.42 56.6
 59.94 58.3  58.25 55.53 59.79 57.51 62.82 62.57 60.23 65.08 65.58 65.64
 65.28 65.03 67.84 73.74 72.66 71.31 72.3  68.81 66.61 63.66 63.85 67.25
 67.19 62.34 62.98 69.89 73.13 65.09 64.71 64.05 63.97 70.48 71.11 69.05
 71.99 72.03 69.9  72.16 70.97 70.55 69.73 69.93 70.6  75.54 49.14 49.1
 44.66 44.64  4.23  5.53 17.11 67.6  64.81 63.13 63.48 62.25]
unique deviation of Material2	=	 [ 1.72  1.2   1.42  1.78  1.58  2.12  1.17  1.5   0.87  0.88  0.    1.31
  1.67  1.81  2.87  1.19  0.42  1.39  1.28  1.22  1.13  1.49  2.1   2.29
  3.11  3.1   2.88  1.48  0.12  0.1   0.05  0.65  0.49  3.44  4.02  6.88
  2.31  2.99  0.24  1.01  0.61  1.64  2.8   4.64  3.56  2.51  2.19  0.51
  0.09  0.06  4.99  3.73 10.76  7.99  5.06  1.84  2.24  1.6   3.46]
unique deviation of Material3	=	 [54 53 55 56 58 57 59 60 62 61 63 64 52 50 48 47 40 42 44 41]
unique deviation of Condition	=	 [1.66219 1.58399 1.61731 1.66228 1.63195 1.68034 1.58206 1.54998 1.5623
 1.57818 1.60401 1.59594 1.54814 1.63134 1.60228 1.54949 1.57841 1.61183
 1.51081 1.56443 1.53995 1.56949 1.4133  1.54777 1.65523 1.29994 1.19975
 1.20817 1.30621 1.29842 1.40483 1.45056 1.54357 1.6894  1.74695 1.74919
 1.78053 1.78104 1.72387 1.73496 1.71966 1.60325 1.66783 1.69836 1.77967
 1.81271 1.81485 1.72526 1.86782 2.00677 1.95366 1.89387 1.81651 1.45939
 1.38934 1.33945 1.42094 1.5768  1.41229 1.54605 1.55182 1.6039  1.67265
 1.55242 1.45728 1.26174 1.28802 1.36399 1.4221  1.67219 2.1714  2.31909
 2.14314 2.08081 2.1707  1.99418 1.61437 1.64758 1.69592 1.66118 1.48216
 1.49734]
unique deviation of Octane	=	 [92.19 92.74 91.88 92.8  92.56 92.61 92.33 92.22 91.56 92.17 92.75 92.89
 92.79 92.55 92.42 92.43 92.77 92.6  92.3  92.48 91.61 91.3  91.37 91.25
 90.76 90.9  90.43 90.83 92.18 91.73 91.1  91.74 91.46 91.44 91.9  92.09
 90.64 91.09 90.51 90.24 91.01 91.92 92.16 91.36 92.68 92.88 92.59 91.35
 90.29 90.71 90.41 89.87 89.98 90.   89.66 90.08 90.67 90.59 91.06 90.69
 91.11 90.32 90.36 90.57 94.17 94.39 93.42 94.65 97.61 97.08 95.12 91.86]

In [55]:

# nunique() : gives you number of rows with unique values.
for i in df.columns[1:]:
    print(f"non unique deviation of {i}\t=\t",df[i].nunique())

standard deviation of Material1	=	 82
standard deviation of Material2	=	 59
standard deviation of Material3	=	 20
standard deviation of Condition	=	 82
standard deviation of Octane	=	 72

In [53]:
# Calculating standard deviation for Material1, Material2, Material3, Condition and Octane columns
for i in df.columns[1:]:
    print(f"standard deviation of {i}\t=\t",df[i].std())

min of Material1	=	 12.43739992552937
min of Material2	=	 1.901951896806471
min of Material3	=	 5.377582921059388
min of Condition	=	 0.2197298227524435
min of Octane	=	 1.4011243226995753

In [52]:
# Calculating minimum for Material1, Material2, Material3, Condition and Octane columns
for i in df.columns[1:]:
    print(f"min of {i}\t=\t",df[i].min())

min of Material1	=	 4.23
min of Material2	=	 0.0
min of Material3	=	 40
min of Condition	=	 1.19975
min of Octane	=	 89.66

In [51]:
# Calculating maximum for Material1, Material2, Material3, Condition and Octane columns
for i in df.columns[1:]:
    print(f"max of {i}\t=\t",df[i].max())

count of Material1	=	 75.54
count of Material2	=	 10.76
count of Material3	=	 64
count of Condition	=	 2.31909
count of Octane	=	 97.61

In [47]:
# Getting all the statistical parameters in one command
df.describe()

          Sample  Material1  Material2  Material3  Condition     Octane
count  82.000000   82.00000  82.000000  82.000000  82.000000  82.000000
mean   41.500000   60.17061   1.663659  55.463415   1.626571  91.849878
std    23.815261   12.43740   1.901952   5.377583   0.219730   1.401124
min     1.000000    4.23000   0.000000  40.000000   1.199750  89.660000
25%    21.250000   55.38000   0.105000  54.000000   1.518095  90.847500
50%    41.500000   62.69500   1.280000  56.000000   1.603575  91.735000
75%    61.750000   67.78000   2.277500  59.750000   1.722818  92.467500
max    82.000000   75.54000  10.760000  64.000000   2.319090  97.610000

In [ ]:
# Data Transformations

In [109]:
# Importing new dataset
df = pd.read_csv('https://raw.githubusercontent.com/TrainingByPackt/Data-Science-with-Python/master/Chapter01/Data/student.csv',index_col=0)
df.head()

            Age  Gender      Grade Employed
Student_id
1            19    Male  1st Class      yes
2            20  Female  2nd Class       no
3            18    Male  1st Class       no
4            21  Female  2nd Class       no
5            19    Male  1st Class       no

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 232 entries, 1 to 232
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Age       232 non-null    int64
 1   Gender    232 non-null    object
 2   Grade     232 non-null    object
 3   Employed  232 non-null    object
dtypes: int64(1), object(3)
memory usage: 9.1+ KB

In [72]:
# Command to include and exclude columns of numeric data type
df.select_dtypes(exclude='int64').head()

            Gender      Grade Employed
Student_id
1             Male  1st Class      yes
2           Female  2nd Class       no
3             Male  1st Class       no
4           Female  2nd Class       no
5             Male  1st Class       no

In [73]:
df.select_dtypes(include='int64').head()

            Age
Student_id
1            19
2            20
3            18
4            21
5            19

In [ ]:
# Command to include and exclude columns of object data type

In [74]:
df.select_dtypes(exclude='object').head()

            Age
Student_id
1            19
2            20
3            18
4            21
5            19

In [75]:
df.select_dtypes(include='object').head()

            Gender      Grade Employed
Student_id
1             Male  1st Class      yes
2           Female  2nd Class       no
3             Male  1st Class       no
4           Female  2nd Class       no
5             Male  1st Class       no

In [76]:
# Getting unique values from Grade column
df["Grade"].nunique()

3

In [77]:
# Getting number of unique values from grade column
df["Grade"].unique()

array(['1st Class', '2nd Class', '3rd Class'], dtype=object)

In [78]:
# Getting the proportion of categories from categorical columns
df["Grade"].value_counts()

2nd Class    80
3rd Class    80
1st Class    72
Name: Grade, dtype: int64

In [79]:
# Getting the proportion of categories from gender columns
df["Gender"].value_counts()

Male      136
Female     96
Name: Gender, dtype: int64

In [ ]:
# Getting the proportion of categories from employed columns
df["Employed"].value_counts()

In [98]:
# Replacing some values
## Male - 0, Female - 1, 
## no - 0, Yes 1 (employed)
## 1st class - 1, 2, 3 - GRADE
df['Gender'].replace("Male","0")
df['Gender'].replace("Female","1")

df['Employed'].replace('no',"0")
df['Employed'].replace('yes',"1")

df['Grade'].replace('1st Class',"1")
df['Grade'].replace('2nd Class',"2")
df['Grade'].replace('3rd Class',"3")

df

            Age  Gender      Grade Employed
Student_id
1            19    Male  1st Class      yes
2            20  Female  2nd Class       no
3            18    Male  1st Class       no
4            21  Female  2nd Class       no
5            19    Male  1st Class       no
...         ...     ...        ...      ...
228          21  Female  1st Class       no
229          20    Male  2nd Class       no
230          20    Male  3rd Class      yes
231          19  Female  1st Class      yes
232          20    Male  3rd Class      yes

[232 rows x 4 columns]

In [110]:
# Replacing some values
## Male - 0, Female - 1, 
## no - 0, Yes 1 (employed)
## 1st class - 1, 2, 3 - GRADE

df.replace(to_replace=['Male','Female','no','yes','1st Class', '2nd Class', '3rd Class'],value=[0,1,0,1,1,2,3])

            Age  Gender  Grade  Employed
Student_id
1            19       0      1         1
2            20       1      2         0
3            18       0      1         0
4            21       1      2         0
5            19       0      1         0
...         ...     ...    ...       ...
228          21       1      1         0
229          20       0      2         0
230          20       0      3         1
231          19       1      1         1
232          20       0      3         1

[232 rows x 4 columns]

In [112]:
# Basic Data Transformation
df = pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]), columns = ['a','b','c'])
df.head()

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [113]:
# Applying a small transformation
df.transform(func = lambda x : x*10)

    a   b   c
0  10  20  30
1  40  50  60
2  70  80  90

In [114]:
# Applying a small transformation
df.transform(func = lambda x : np.log(x))

          a         b         c
0  0.000000  0.693147  1.098612
1  1.386294  1.609438  1.791759
2  1.945910  2.079442  2.197225

In [115]:
# Applying a small transformation
df.transform(func = lambda x : np.exp(x))

             a            b            c
0     2.718282     7.389056    20.085537
1    54.598150   148.413159   403.428793
2  1096.633158  2980.957987  8103.083928